src/InformationRegisters/Склонение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Склонение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Падеж</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Падеж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/Падеж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Падеж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Именительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Родительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дательный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Винительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Творительный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предложный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/СклонениеПредставленийОбъектовСервер/Ext/Module.bsl
// Склоняет представление объекта.
// Только для работы на ОС Windows.
//
// Параметры:
// 	Представление - Строка 		- Строка, в которой содержится ФИО для склонения.
// 	Падеж 		- Число  		- падеж, в который необходимо просклонять представление объекта.
//  	               			1 - Именительный.
//                  			2 - Родительный.
//                  			3 - Дательный.
//                  			4 - Винительный.
//                  			5 - Творительный.
//                  			6 - Предложный.
// Объект 	- ОбъектСклонения 	- Ссылка на объект, реквизит которого склоняется.
//
// Возвращаемое значение:
//  Строка - Результат склонения представления объекта в падеже.
//
Функция ПросклонятьПредставление(Представление, Падеж, Объект = Неопределено) Экспорт
	
	Возврат Просклонять(Представление, Падеж, Объект);
	
КонецФункции

Функция СтруктураСклонений() Экспорт

	СтруктураСклонений = Новый Структура("Именительный, 
										 |Родительный, 
										 |Дательный, 
										 |Винительный, 
										 |Творительный, 
										 |Предложный");
    Возврат СтруктураСклонений;

КонецФункции // Структурасклонений()

Функция Просклонять(Представление, Падеж, Объект = Неопределено, ЭтоФИО = Ложь, Пол = Неопределено) 
	
	ПредставлениеВПадеже = "";
	
	СтруктураСклонений = Структурасклонений();
	
	СоответствиеПадежей = Новый Соответствие;
	
	СоответствиеПадежей.Вставить(1, "Именительный");
	СоответствиеПадежей.Вставить(2, "Родительный");
	СоответствиеПадежей.Вставить(3, "Дательный");
	СоответствиеПадежей.Вставить(4, "Винительный");
	СоответствиеПадежей.Вставить(5, "Творительный");
	СоответствиеПадежей.Вставить(6, "Предложный");
	
	
	ИмяПадежа = СоответствиеПадежей.Получить(Падеж);
	
	Если ИмяПадежа = Неопределено Тогда
		Возврат ПредставлениеВПадеже;
	КонецЕсли;
	
	// сначала получаем склонения из регистра Склонения.
	СоответствиеСклоненияИзРегистра = СклоненияИзРегистра(Объект);
		
	Если СоответствиеСклоненияИзРегистра <> Неопределено И ЗначениеЗаполнено(СоответствиеСклоненияИзРегистра[Падеж]) Тогда
		Возврат СоответствиеСклоненияИзРегистра[Падеж];
	КонецЕсли;
	
	//Возврат СтруктураСклонения[ИмяПадежа];
			
КонецФункции

///////////////////////////////////////////////////////////////////////////
// БЛОК РАБОТЫ С СЕРВИСОМ
///////////////////////////////////////////////////////////////////////////

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПросклонятьСПомощьюСервиса(Представление)  Экспорт

	СтруктураСклонения = Неопределено;	
	Результат = Неопределено;

	Соединение = HTTPСоединениеСервисаСклонений();
	Запрос = HTTPЗапросКСервисуСклонения(Представление);
	Попытка
		Ответ = ВыполнитьЗапросСервисуСклонений(Соединение, Запрос);
    Исключение
        СообщениеОбОшибке = ИнформацияОбОшибке();
		Возврат Неопределено;
    КонецПопытки;
    
    Результат = СтруктураОтветаСервисаСклонений(Ответ);
    
	Если Результат <> Неопределено Тогда
			
		СтруктураСклонения = СтруктураСклонений();
		
		СтруктураСклонения.Именительный 	= Представление;
		СтруктураСклонения.Родительный 	    = Результат.Р;
		СтруктураСклонения.Дательный 		= Результат.Д;
		СтруктураСклонения.Винительный 	    = Результат.В;
		СтруктураСклонения.Творительный 	= Результат.Т;
		СтруктураСклонения.Предложный 		= Результат.П;
				
    КонецЕсли;
    
    Возврат СтруктураСклонения;
    
КонецФункции // ПросклонятьСПомощьюСервиса()

Функция HTTPСоединениеСервисаСклонений()
	
	АдресСервера = "ws3.morpher.ru";
	
	ИнтернетПрокси = Неопределено;
    //Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
    //	МодульПолучениеФайловИзИнтернетаКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернетаКлиентСервер");
    //	ИнтернетПрокси = МодульПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("https");
    //КонецЕсли;
	
	Таймаут = 10;
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	Возврат Новый HTTPСоединение(АдресСервера,,,, ИнтернетПрокси, Таймаут, ЗащищенноеСоединение);
	
КонецФункции

Функция HTTPЗапросКСервисуСклонения(СклоняемыйТекст)
	
	ТекстЗапроса = "/russian/declension?s=" + СклоняемыйТекст;
	
    //УстановитьПривилегированныйРежим(Истина);
    ////ВладелецТокена = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("РегистрСведений.Склонение");
    ////Токен = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("РегистрСведений.Склонение", "ТокенДоступаКСервисуMorpher", Истина);
    //ДанныеИзБезопасногоХранилища(Владелец, ИмяБезопасноеХранилищеДанных, Ключи)
    //УстановитьПривилегированныйРежим(Ложь);
    //
    //Если ЗначениеЗаполнено(Токен) Тогда
    //	ТекстЗапроса = ТекстЗапроса + "&token=" + Токен;
    //КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("User-Agent", "1C Enterprise 8.3");
	Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("charset", "UTF-8");
	
	Возврат Новый HTTPЗапрос(ТекстЗапроса, Заголовки);
	
КонецФункции

Функция ВыполнитьЗапросСервисуСклонений(Соединение, Запрос)
	
    Попытка
        Ответ = Соединение.Получить(Запрос);
    Исключение
        РезультатДиагностики = ОбщегоНазначения.ДиагностикаСоединения(Соединение.Сервер);
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			           |
			           |Результат диагностики:
			           |%2'"),
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			РезультатДиагностики.ОписаниеОшибки);
    КонецПопытки;
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при обработке запроса к ресурсу:
			           |%1'"),
			Ответ.ПолучитьТелоКакСтроку());
	КонецЕсли;
		
	Возврат Ответ;
	
КонецФункции

Функция СтруктураОтветаСервисаСклонений(Ответ)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////
// КОНЕЦ БЛОКА РАБОТЫ С СЕРВИСОМ
///////////////////////////////////////////////////////////////////////////

Функция СклоненияИзРегистра(Объект) Экспорт
    
    запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |    Склонение.Падеж,
				   
				   //Аверсон ЕАЕ 15.11.2021 СВФР-008380
				   //|    Склонение.Значение
                   |    ВЫРАЗИТЬ(Склонение.Значение КАК Строка(200)) КАК Значение
				   //Аверсон СВФР-008380
				   
                   |ИЗ
                   |    РегистрСведений.Склонение КАК Склонение
                   |ГДЕ
                   |    Склонение.Объект = &Объект
                   |
                   |СГРУППИРОВАТЬ ПО
                   |    Склонение.Падеж,
				   
				   //Аверсон ЕАЕ 15.11.2021 СВФР-008380
				   //|    Склонение.Значение";
                   |    ВЫРАЗИТЬ(Склонение.Значение КАК Строка(200))";
				   //Аверсон СВФР-008380
    Запрос.УстановитьПараметр("Объект", Объект);
    
    Рез = Запрос.Выполнить();
    Если Рез.Пустой() Тогда
        
        Возврат Неопределено;
        
    Иначе
        
        СоответствиеСклонений = Новый Соответствие;
        СписокПадежей = Перечисления.Падеж;
        
        Выборка = Рез.Выбрать();
        Пока Выборка.Следующий() Цикл
            
            СоответствиеСклонений.Вставить(Выборка.падеж,Выборка.Значение);
            
        КонецЦикла;
        
        Возврат СоответствиеСклонений;
    КонецЕсли;
    
    
КонецФункции

// <Описание процедуры>
//
// Параметры:
//  <Объект>  - ссылка объекта склонения
//                 
//  <СоотвествиеСклонений>  - Соотвествие где ключ перечисление "падеж", значение - представление объекта в соотв. падеже
//
Процедура ЗаписатьРезультатСклонения(Объект,СтруктураСклонений) Экспорт
    
    Если ЗначениеЗаполнено(Объект) и ТипЗнч(СтруктураСклонений) = Тип("Структура") Тогда
        МенеджерНаборЗаписейСклонения = РегистрыСведений.Склонение.СоздатьНаборЗаписей();
		МенеджерНаборЗаписейСклонения.Отбор.Объект.Установить(Объект);
        МенеджерНаборЗаписейСклонения.Прочитать();
        МенеджерНаборЗаписейСклонения.Очистить();
		
		Для каждого стр Из СтруктураСклонений Цикл
        
            ЗаписьНабора = МенеджерНаборЗаписейСклонения.Добавить();
            ЗаписьНабора.Объект = Объект;
            ЗаписьНабора.Падеж = Перечисления.Падеж[стр.Ключ];
            ЗаписьНабора.Значение = Стр.Значение;
        КонецЦикла;
        
        МенеджерНаборЗаписейСклонения.Записать(Истина);
    КонецЕсли;
    
КонецПроцедуры // ЗаписатьРезультатСклонения()
